{
  "backend/main.mo": "Motoko canister defining user profiles, role-based access control, seat initialization, and booking data structures with admin-managed roles.",
  "feature_evidence.json": "Feature evidence report mapping features to involved files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "List of prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Tailwind CSS setup defining global theme variables and light/dark mode color tokens.",
  "frontend/index.html": "Basic HTML bootstrap file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main router and layout setup handling authentication state, profile initialization, and page routing.",
  "frontend/src/components/admin/BookingsTable.tsx": "Admin table listing all active bookings with user names, seat info, and formatted date/time.",
  "frontend/src/components/admin/LibraryHoursPanel.tsx": "Admin panel for viewing and updating library opening and closing hours with select inputs.",
  "frontend/src/components/admin/SeatConfigurationPanel.tsx": "Displays seat configuration stats with loading state and shows total, reserved, and general seats.",
  "frontend/src/components/admin/UserRoleManager.tsx": "Lists user profiles, shows current roles, and allows admins to change user roles with a loading fallback.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout, showing status and clearing query cache on sign-out.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal that prompts new users to enter their name and saves a default General Student profile.",
  "frontend/src/components/booking/ActiveBookingCard.tsx": "Shows details of the user’s active booking and provides a confirmation dialog to cancel it.",
  "frontend/src/components/booking/DateAndSlotPicker.tsx": "Lets users pick a date and time slot based on schedule hours, displaying available 2‑hour slots.",
  "frontend/src/components/booking/SeatGrid.tsx": "Renders seat availability, allows selecting a seat, and submits a booking for the chosen time slot.",
  "frontend/src/components/booking/SeatLegend.tsx": "Explains seat status icons and indicates reserved seat rules based on user role.",
  "frontend/src/components/common/AccessDeniedScreen.tsx": "Displays an access‑denied message with a button linking back to the dashboard.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main layout with navigation, user greeting, and footer, showing admin links when applicable.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useCallerContext.ts": "Fetches caller-specific data such as user profile, admin status, and library role using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context for authentication, identity loading, login, and logout.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on user profiles, roles, library hours, seats, and bookings.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with a warm palette.",
  "frontend/src/main.tsx": "Bootstraps the app with React, providing query and identity providers.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with tabs for user management, bookings, and configuration, restricted to admins.",
  "frontend/src/pages/SignedOutLandingPage.tsx": "Landing page for signed‑out users showing library info, booking features, and a login button with a hero image.",
  "frontend/src/pages/UserDashboardPage.tsx": "User dashboard that loads profile, schedule, and bookings, enabling slot selection and seat booking with tabs for booking and info.",
  "frontend/src/utils/timeSlots.ts": "Utility functions for generating 2‑hour time slots, formatting dates and times, and converting between dates and nanoseconds.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters and session storage values, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and container settings for the frontend UI.",
  "project_state.json": "Project metadata describing the system’s features, requirements, and current implementation state."
}