{
  "kind": "build_request",
  "title": "Add recovery flow to bootstrap current user as admin when bootstrap token was never used",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend recovery/bootstrapping method that allows the currently authenticated caller to become an Admin using the existing bootstrap secret when (and only when) no admin has been initialized yet.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Do you want the account you are using right now to become the admin?\nUser: yes"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a shared (update) method that accepts the bootstrap secret and attempts to initialize admin access for the caller.",
        "If an admin already exists (system already initialized), the method must not change admin membership/roles and must return an explicit error (trap or Result-like error).",
        "If the secret is missing/invalid, the method must reject the request.",
        "If the secret is valid and no admin exists yet, the method makes the caller an admin and returns success.",
        "The change is implemented in the single actor at backend/main.mo (no extra actors/services)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a frontend admin-initialization flow that reads the bootstrap token from the URL hash parameter `caffeineAdminToken` and, after the user signs in, calls the backend bootstrapping method to make the current user an admin (only if the system is not initialized yet).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-20"
        ],
        "quotes": [
          "Open the site with this format: https://your-site.xyz/#caffeineAdminToken=YOUR_SECRET",
          "User: yes"
        ]
      },
      "acceptanceCriteria": [
        "The app uses the existing URL utilities (frontend/src/utils/urlParams.ts) to read `caffeineAdminToken` from the hash and persist it in sessionStorage for the session.",
        "After successful login (Internet Identity), if a token is present, the app calls the backend bootstrapping method and then refreshes/invalidate relevant React Query state so `useIsCallerAdmin()` updates without a hard reload.",
        "On success, the Admin Dashboard navigation link becomes visible in the header (AppShell) for the same session.",
        "On failure (token invalid, or admin already initialized), show a clear English error message (non-crashing) and do not break normal user flows.",
        "The token is removed from the address bar after extraction (leveraging existing clear-from-hash behavior)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a minimal, user-facing guidance message in the UI for the admin bootstrap flow so the user knows what to do when admin is not initialized (token link + login), without exposing the secret itself.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-12"
        ],
        "quotes": [
          "when i open this it does not show admin",
          "Since you never opened the site with the admin token, it confirms the root problem: Your system has no admin initialized."
        ]
      },
      "acceptanceCriteria": [
        "When the user is signed in but not an admin, the UI provides a short English explanation that admin access requires one-time initialization via a special link containing `#caffeineAdminToken=...` followed by login.",
        "No UI element prints the actual token value.",
        "The guidance does not appear for users already recognized as admins."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn/ui sources are read-only).",
    "Do not edit any frontend paths listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Keep all backend logic in backend/main.mo (single-actor architecture).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity).",
    "Creating a general-purpose admin management UI for non-admins beyond the one-time bootstrap/recovery flow.",
    "Changing seat booking rules, seat counts, or booking expiry behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}