{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend admin recovery bootstrap via URL hash token",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Extract `caffeineAdminToken` from the URL hash, persist it for the session, and after Internet Identity login call the backend admin-bootstrapping method then refresh admin-related React Query state without a hard reload.",
      "acceptanceCriteria": [
        "The app uses the existing URL utilities (frontend/src/utils/urlParams.ts) to read `caffeineAdminToken` from the hash and persist it in sessionStorage for the session.",
        "After successful login (Internet Identity), if a token is present, the app calls the backend bootstrapping method and then refreshes/invalidate relevant React Query state so `useIsCallerAdmin()` updates without a hard reload.",
        "On success, the Admin Dashboard navigation link becomes visible in the header (AppShell) for the same session.",
        "On failure (token invalid, or admin already initialized), show a clear English error message (non-crashing) and do not break normal user flows.",
        "The token is removed from the address bar after extraction (leveraging existing clear-from-hash behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Extend the typed backend interface to include the new admin recovery/bootstrapping backend function (the one that accepts the bootstrap secret and attempts to make the current caller an admin), so the frontend can call it with proper TypeScript typing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire an admin-initialization flow into the authenticated app lifecycle: (1) on app load/mount extract `caffeineAdminToken` using the existing URL utilities so it is persisted in sessionStorage and cleared from the address bar, (2) after successful Internet Identity login (when identity/actor is available) if a token exists call the backend bootstrapping function, and (3) on success/failure show a non-crashing English toast/message and invalidate/refetch React Query state (at minimum `isCallerAdmin`, and any other role/profile queries needed) so `useIsCallerAdmin()` updates and AppShell reveals the Admin Dashboard link in the same session."
        },
        {
          "path": "frontend/src/hooks/useCallerContext.ts",
          "operation": "modify",
          "description": "Ensure `useIsCallerAdmin()` updates promptly after the bootstrap attempt by aligning its query key usage/invalidation expectations with the new flow (e.g., keeping `['isCallerAdmin']` stable and not overly caching), so invalidation/refetch from the bootstrap logic reliably causes the header admin link to appear without a full reload."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Show a minimal guidance message for signed-in non-admin users explaining how one-time admin initialization works via a special token link and login, without revealing the token value.",
      "acceptanceCriteria": [
        "When the user is signed in but not an admin, the UI provides a short English explanation that admin access requires one-time initialization via a special link containing `#caffeineAdminToken=...` followed by login.",
        "No UI element prints the actual token value.",
        "The guidance does not appear for users already recognized as admins."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/UserDashboardPage.tsx",
          "operation": "modify",
          "description": "Add a small, user-facing guidance block that renders only when the user is signed in and `useIsCallerAdmin()` indicates they are not an admin, explaining in English that admin access requires a one-time initialization by opening a special link containing `#caffeineAdminToken=...` and then logging in; ensure the token value is never displayed."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Optionally reinforce the same guidance at the layout level (only for signed-in non-admins) so it’s discoverable even if the user navigates away from the dashboard; ensure it never prints the token value and does not show for admins."
        }
      ]
    }
  ]
}